# parameters
Det_nc: 1  # number of classes
Lane_nc: 2  # number of classes
driveArea_nc: 2  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
HeadOut: [105, 128, 151] # Det_out_idx, Da_Segout_idx, LL_Segout_idx

# anchors
anchors:
  - [3,9,5,11,4,20]  # P3/8
  - [7,18,6,39,12,31]  # P4/16
  - [19,50,38,81,68,157]  # P5/32

# [from, module, args]
# from：输入来自那一层，-1代表上一次，1代表第1层，3代表第3层
# module：子模块
# args：模块参数，channel_out，kernel_size，stride，padding，bias等]

  # [from, number, module, args]
backbone:
  [[-1, 1, Conv, [32, 3, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]],
   
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 11
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 16-P3/8  
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 24
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 29-P4/16  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 37
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 42-P5/32  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 50
  ]










Neck:
  [[-1, 1, SPPCSPC, [512]], # 51
  
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [37, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 63
   
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [24, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
  ]










Det_Head: 
  [[-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], # 75
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3, 63], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 88
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3, 51], 1, Concat, [1]],
   
   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], # 101
   
   [75, 1, RepConv, [256, 3, 1]],
   [88, 1, RepConv, [512, 3, 1]],
   [101, 1, RepConv, [1024, 3, 1]],

   [[102,103,104], 1, IDetect, [Det_nc, anchors]],   # Detect(P3, P4, P5)
 ]










DriveArea_Head:
 [[ 67, 1, Conv, [128, 3, 1]],   #106
  [ -1, 1, Upsample, [None, 2, 'nearest']],  #107

#  E-ELAN
  [-1, 1, Conv, [64, 1, 1]],             
  [-2, 1, Conv, [64, 1, 1]],             
  [-1, 1, Conv, [64, 3, 1]],              
  [-1, 1, Conv, [64, 3, 1]],              
  [-1, 1, Conv, [64, 3, 1]],              
  [-1, 1, Conv, [64, 3, 1]],              
  [[-1, -3, -5, -6], 1, Concat, [1]],           
#  E-LAN
  [-1, 1, Conv, [64, 1, 1]],  # 115        

  [ -1, 1, Conv, [32, 3, 1]],    #116
  [ -1, 1, Upsample, [None, 2, 'nearest']],  #117
  [ -1, 1, Conv, [16, 3, 1]],    #118

#  E-ELAN
  [-1, 1, Conv, [8, 1, 1]],             
  [-2, 1, Conv, [8, 1, 1]],             
  [-1, 1, Conv, [8, 3, 1]],              
  [-1, 1, Conv, [8, 3, 1]],              
  [-1, 1, Conv, [8, 3, 1]],              
  [-1, 1, Conv, [8, 3, 1]],              
  [[-1, -3, -5, -6], 1, Concat, [1]],           
#  E-LAN
  [-1, 1, Conv, [8, 1, 1]],

  [ -1, 1, Upsample, [None, 2, 'nearest']],  
  [ -1, 1, Conv, [driveArea_nc, 3, 1]], #128
 ]










Lane_Head:
 [[ 67, 1, Conv, [128, 3, 1]],   #129
  [ -1, 1, Upsample, [None, 2, 'nearest']],  #130

#  E-ELAN
  [-1, 1, Conv, [64, 1, 1]],             
  [-2, 1, Conv, [64, 1, 1]],             
  [-1, 1, Conv, [64, 3, 1]],              
  [-1, 1, Conv, [64, 3, 1]],              
  [-1, 1, Conv, [64, 3, 1]],              
  [-1, 1, Conv, [64, 3, 1]],              
  [[-1, -3, -5, -6], 1, Concat, [1]],           
#  E-LAN
  [-1, 1, Conv, [64, 1, 1]],  #138

  [ -1, 1, Conv, [32, 3, 1]],    #139
  [ -1, 1, Upsample, [None, 2, 'nearest']],  #140
  [ -1, 1, Conv, [16, 3, 1]],    # 141

#  E-ELAN
  [-1, 1, Conv, [8, 1, 1]],             
  [-2, 1, Conv, [8, 1, 1]],             
  [-1, 1, Conv, [8, 3, 1]],              
  [-1, 1, Conv, [8, 3, 1]],              
  [-1, 1, Conv, [8, 3, 1]],              
  [-1, 1, Conv, [8, 3, 1]],              
  [[-1, -3, -5, -6], 1, Concat, [1]],  # 148          
#  E-LAN
  [-1, 1, Conv, [8, 1, 1]],

  [ -1, 1, Upsample, [None, 2, 'nearest']],  #150
  [ -1, 1, Conv, [Lane_nc, 3, 1]], #151
 ]